{
    "abstract": "The accurate diagnosis of brain tumors is of primary importance for optimal therapy planning. In clinical practice, this is determined on a biopsy, exposing the patient to the risk of complications. Moreover, sampling bias and performer variability may influence the result. Several studies have investigated the histological grading of brain tumors in a non-invasive way by extracting features from medical images. A multicenter study where both tumor grade and cell type are simultaneously predicted is however lacking. In this study we collected structural MRI-scans from 294 patients with glioma acquired in different centers (the local hospital and two online databases). The goal was to predict tumor grade and cell type of individual patients using a radiomics study with Random Forests. In a multiclass design, we obtain a global accuracy of 59.9% to predict tumor grade and 53.4% to predict cell type. Converting the problem to binary classification, we obtain an accuracy of 98.3% to distinguish between meningioma and glioma, and 84.5% to distinguish between low-grade glioma and glioblastoma. A high degree of diagnosis variability and overlap between different low-grade classes might cause the reduced prediction accuracy. Our results however show that radiomics on structural MRI is a suitable approach for non-invasively assessing brain tumor diagnosis and might be used for individual treatment planning.", 
	"introduction": "HE accurate diagnosis of primary brain tumor grade and histology is of utmost importance for individual treatment planning. Up to now, this diagnosis is determined on a biopsy, where a small part of the tumor is surgically removed and investigated by a senior neuropathologist. This procedure is not only biased by the tumor heterogeneity and prone to observer variability, it also exposes the patient to the risk of complications, both during and after the surgery. In literature several efforts have been made to predict tumor grade and histology in a non-invasive way, namely based on quantitative features extracted from magnetic resonance imaging (MRI) scans. Both Zacharaki et al. [1] and Sachdeva et al. [2] designed a multiclass (in contrast to a binary e.g. lowgrade versus high-grade) classification model. The former authors extracted 152 features on structural and perfusion MRI of 97 patients and achieved a 76.3% accuracy in predicting tumor grade. In the study by Sachdeva et al. [2] 218 features on 2D slices of contrast enhanced T1 (T1ce) MRI-slices  were calculated from 55 patients. They achieved a global accuracy of 85.2% in predicting tumor cell type (not only glioma, but also metastases, meningioma and even normal tissue). A study where both histological grade and cell type are predicted simultaneously is however lacking. Previous studies were performed on a limited patient population examined on the same imaging system. For clinical practice, it might be interesting to be directly able to compare scans acquired on different systems. To meet these demands, we collected structural MRI scans of 294 patients acquired in different centers and examined these with a technique called radiomics [3]. Radiomics is a field of medical study that aims to extract large amount of quantitative features from medical images and to correlate them with clinically relevant parameters, such as tumor phenotype, therapy response or survival",
	"methodology": "We selected 294 patients from different databases according to following inclusion criteria: a histologically proven primary brain tumor (meningioma (M), astrocytoma (A), oligodendroglioma (O) or glioblastoma (G)), no surgery or therapy prior to scanning and the availability of T1-weighted contrast enhanced and fluid attenuation inversion recovery (FLAIR) MRI collected during the same protocol. 132 cases were retrospectively collected at our center (with permission of the local ethics committee), while the other scans were downloaded from The Cancer Imaging Archive [4]. 84 cases are part of the TCGA-LGG dataset [5], and 78 cases are part of the REMBRANDT collection [6]. An overview of the patients is given in Table I. Due to the different sources, the data are very heterogeneous concerning scanning protocols, image resolution, voxel size etc. Therefore all scans are normalized to MNI-space and linearly interpolated to 1 mm × 1 mm × 1 mm voxel size using SPM12 (Wellcome Trust Centre for Neuroimaging, University College, London) running on MATLAB (version R2016b, MathWorks Inc., Natick, MA, USA). Next, the intensity on the MRI scans is normalized using white stripe normalization [7]. Brain tumors were segmented using an automatic in-house developed algorithm. This algorithm is based on a Random Forests model where a high-dimensional feature vector based on both T1ce and FLAIR scans (containing local texture, abnormality features and healthy tissue probabilities) for every voxel is used as input. The model calculates tumor probabilities, followed by a dedicated voxel-clustering algorithm. This results in 6 different tumor masks: enhancing tissue, non-enhancing tissue, necrosis, edema, tumor core and total abnormal region. An example of the segmentation output is given in Fig. 1. Next, per scan and per tumor mask 207 quantitative features are extracted: 14 histogram or first-order statistics (FOS) features, 8 shape features and 185 second-order statistics (texture) features. This results in 2484 parameters",
    "results": "The optimal number of parameters for predicting both tumor grade and histology was found to be 30 using grid search. For the grade prediction task, these features are mainly based on the contrast-enhancing part of the tumor. For predicting histology, next to enhancing features, also parameters based on the total abnormal region and the edema have a large discriminating power. 24 out of the 30 best features occur for both classification tasks, proving the robustness of these parameters. Since the number of features greatly exceeds the number of patients in a single class, feature reduction and selection is an important aspect of the classification algorithm. We used the OOBPermutedPredictorDeltaError value integrated in MATLAB’s TreeBagger implementation of Random Forests to assess the individual predictor importance. This gives a ranking of the discriminating power of the features to predict either tumor grade or histology. Finally, the actual classification is performed, where the goal is to predict the tumor grade and histology of a patient based on a Random Forests model trained on the features of all other patients (leave-one-out validation). For every patient two", 
	"conclusion": " Our results show that radiomics on structural MRI is a suitable approach for non-invasively assessing brain tumor diagnosis. The general framework that we have applied here, might also be used for other tasks such as assessing molecular biomarkers, individual therapy response and/or survival prediction." 
	}